print("HI V")

#--------------------------------------------------------1----------------------------------------------------------
print("Задание 1----")
a = 120
b = 145
print("Мои переменные a и b - ", a, b)
string1 = input("Введите буквенное обозначение вашей первой переменной: ")
number1 = int(input("Введите первое число: "))
string2 = input("Введите буквенное обозначение вашей второй переменной: ")
number2 = int(input("Введите второе число: "))
print("Введеные значения - %6s %5d %6s %5d" % (string1, number1, string2, number2))

#--------------------------------------------------------2----------------------------------------------------------
print("Задание 2----")
time = int(input("Ваше время в секундах: "))
hours = time // 3600
minutes = (time - hours * 3600) // 60
seconds = time - (hours * 3600 + minutes * 60)
if hours<10:
    hours = str('0' + str(hours))
else:
    hours = str(hours)
if minutes<10:
    minutes = str('0' + str(minutes))
else:
    minutes = str(minutes)
if seconds<10:
    seconds = str('0' + str(seconds))
else:
    seconds = str(seconds)
print(f"Время в чч:мм:сс формате:  {hours} : {minutes} : {seconds}")

#--------------------------------------------------------3----------------------------------------------------------
print("Задание 3----")
n = int(input("Введите число: "))
total = (n + int(str(n) + str(n)) + int(str(n) + str(n)+ str(n)))
print("Сумма чисел", n, "+", n, n, "+", n,n,n, "= %d" % total)

#--------------------------------------------------------4----------------------------------------------------------
print("Задание 4----")
n = abs(int(input("Введите целое положительное число: ")))
max = n % 10
while n >= 1:
    n = n // 10
    if n % 10 > max:
        max = n % 10
    if n > 9:
        continue
    else:
        print("Максимальное цифра в числе =", max)
        break

#--------------------------------------------------------5----------------------------------------------------------
print("Задание 5----")
profit = float(input("Выручка компании: "))
costs = float(input("Издержки компании: "))
if profit > costs:
    print(f"Компания работает с прибылью. Рентабельность выручки составила {profit / costs:.2f}")
    workers = int(input("Введите количество сотрудников компании "))
    print(f"Прибыль в расчете на одного сторудника сотавила {profit / workers:.2f}")
elif profit == costs:
    print("Компания работает в ноль")
else:
    print("Компания несёт убыток")

#--------------------------------------------------------6----------------------------------------------------------
print("Задание 6----")
a = float(input("Результат пробежки в км, день первый: "))
b = float(input("Желаемый общий результат в км: "))
result_days = 1
result_km = a
while result_km < b:
        a = a + 0.1 * a
        result_days += 1
        result_km = result_km + a
print(f"Вы достигнете требуемых показателей на %.d день" % result_days)

